app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."id" ASC
---
  def index
    @todo = Todo.new
    # also order the todo's
    @todos = Todo.order(:id)

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Bla Bla"], ["created_at", 2016-10-20 08:57:37 UTC], ["updated_at", 2016-10-20 08:57:37 UTC]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", 2016-11-19 16:53:07 UTC], ["id", 45]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)